# BarDiameterTooLarge Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..BarDiameterTooLarge Property
BuiltInFailures..::..RebarFailures Class See Also
---
Rebar Bar Diameter is too large.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BarDiameterTooLarge { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BarDiameterTooLarge As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BarDiameterTooLarge {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace